#include <stdio.h>

int main() {
    int number; //оголошення змінної для зберігання введеного числа.
    int lastDigit; //оголошення змінної для зберігання останньої цифри.

    //запит введення цілого числа від користувача.
    printf("Vvedit tsile chyslo: ");
    scanf("%d", &number); //зчитування цілого числа з клавіатури.

    lastDigit = number % 10; //обчислення останньої цифри за допомогою операції остачі від ділення на 10.

    //виведення останньої цифри. 
    printf("Ostannia tsyfra: %d\n", lastDigit);

    return 0; //завершення програми з кодом 0.
}
