#include <stdio.h> //підключення бібліотеки для вводу-виводу.

int main() {
    int birth_year; //оголошення змінної для року народження.
    int current_year = 2025; //оголошення змінної для поточного року.
    int age; //оголошення змінної для віку.

    printf("Vvedit rik narodzhennia: "); //виведення запиту для введення року народження.
    scanf("%d", &birth_year); //зчитування року народження з клавіатури.

    age = current_year - birth_year; //обчислення віку шляхом віднімання року народження від поточного року.

    printf("Vash vik: %d\n", age); //виведення обчисленого віку.

    return 0; //успішне завершення програми.
}